Documents/ПроизвольнаяОперацияПоСчетам.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Document>
		<Properties>
			<Name>ПроизвольнаяОперацияПоСчетам</Name>
			<BasedOn>
				<xr:Item>Document.Доход</xr:Item>
				<xr:Item>Document.ПроизвольнаяОперацияПоСчетам</xr:Item>
				<xr:Item>Document.Расход</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиНаСчетах</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Расход</v8:Type>
						<v8:Type>cfg:DocumentRef.ОтменаРасхода</v8:Type>
						<v8:Type>cfg:DocumentRef.ПроизвольнаяОперацияПоСчетам</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежнаяСуммаНеотрицательная</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетЗачисления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетСписания</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Счета</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ПроизвольнаяОперацияПоСчетам/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	ОбновлениеИнформационнойБазы.ПроверитьОбъектОбработан(ЭтотОбъект);
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Доход") Тогда
		ЗаполнитьПоДоходу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.Расход") Тогда
		ЗаполнитьПоРасходу(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ОтменаРасхода") Тогда
		ЗаполнитьПоОтменеРасхода(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ПроизвольнаяОперацияПоСчетам") Тогда
		ЗаполнитьПоПроизвольнойОперации(ДанныеЗаполнения);
	ИначеЕсли ТипЗнч(ДанныеЗаполнения) = Тип("Структура") И ДанныеЗаполнения.Свойство("ЭтоВыпискаРайффайзенбанка") Тогда
		ЗаполнитьПоВыпискеРайффайзенбанка(ДанныеЗаполнения);
	КонецЕсли;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	ПроведениеДокументов.СоздатьИЗаписатьДвиженияПриПроведении(ЭтотОбъект);
	
	ДоходыРасходы.ПроверитьОстатокНаСчетеПриПроведении(СчетСписания, Новый Граница(Дата, ВидГраницы.Включая), Отказ);
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ОбщегоНазначенияПятьДенег.УстановитьПризнакЗаписыватьДляВсехНаборовДвижений(ЭтотОбъект);
	Движения.Записать();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ЗаполнитьПоДоходу(ДанныеЗаполнения)
	Документы.ПроизвольнаяОперацияПоСчетам.ЗаполнитьНовыйОбъект(ЭтотОбъект);
	
	ДокументОснование = ДанныеЗаполнения;
		
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Счет, СуммаДокумента");
	СчетЗачисления = РеквизитыДокумента.Счет;
	СуммаДокумента = РеквизитыДокумента.СуммаДокумента;
КонецПроцедуры

Процедура ЗаполнитьПоРасходу(ДанныеЗаполнения)
	Документы.ПроизвольнаяОперацияПоСчетам.ЗаполнитьНовыйОбъект(ЭтотОбъект);
	
	ДокументОснование = ДанныеЗаполнения;
		
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Счет, СуммаДокумента");
	СчетСписания = РеквизитыДокумента.Счет;
	СуммаДокумента = РеквизитыДокумента.СуммаДокумента;
КонецПроцедуры

Процедура ЗаполнитьПоОтменеРасхода(ДанныеЗаполнения)
	Документы.ПроизвольнаяОперацияПоСчетам.ЗаполнитьНовыйОбъект(ЭтотОбъект);
	
	ДокументОснование = ДанныеЗаполнения;
		
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, "Счет, СуммаДокумента");
	СчетЗачисления = РеквизитыДокумента.Счет;
	СуммаДокумента = РеквизитыДокумента.СуммаДокумента;
КонецПроцедуры

Процедура ЗаполнитьПоПроизвольнойОперации(ДанныеЗаполнения)
	Документы.ПроизвольнаяОперацияПоСчетам.ЗаполнитьНовыйОбъект(ЭтотОбъект);
	
	ДокументОснование = ДанныеЗаполнения;
		
	СписокРеквизитов = "СчетСписания, СчетЗачисления, СуммаДокумента";
	РеквизитыДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения, СписокРеквизитов);
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, РеквизитыДокумента, СписокРеквизитов);
КонецПроцедуры

Процедура ЗаполнитьПоВыпискеРайффайзенбанка(ДанныеЗаполнения)
	Документы.ПроизвольнаяОперацияПоСчетам.ЗаполнитьНовыйОбъект(ЭтотОбъект);
	
	Дата = ДанныеЗаполнения.Дата;
	СуммаДокумента = ДанныеЗаполнения.Сумма;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
